InProgress/MultiElementWing/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    symmetry
    {
        type            symmetryPlane;
        physicalType    symmetryPlane;
        nFaces          46094;
        startFace       1170242;
    }
    wing
    {
        type            wall;
        physicalType    wall;
        nFaces          58736;
        startFace       1216336;
    }
    tunnel
    {
        type            wall;
        physicalType    wall;
        nFaces          3286;
        startFace       1275072;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          200;
        startFace       1278358;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          200;
        startFace       1278558;
    }
)

// ************************************************************************* //
